classes.dot
digraph "classes" {
rankdir=BT
charset="utf-8"
"wumpus.events.ArrowHit" [color="black", fontcolor="black", label=<{ArrowHit|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.events.ArrowMissed" [color="black", fontcolor="black", label=<{ArrowMissed|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.events.ArrowShot" [color="black", fontcolor="black", label=<{ArrowShot|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.hazards.BottomlessPit" [color="black", fontcolor="black", label=<{BottomlessPit|location<br ALIGN="LEFT"/>|nearby_msg()<br ALIGN="LEFT"/>on_player_enter()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.gui.button.Button" [color="black", fontcolor="black", label=<{Button|bg_colour : tuple<br ALIGN="LEFT"/>font<br ALIGN="LEFT"/>hover_colour : tuple<br ALIGN="LEFT"/>hovered : bool<br ALIGN="LEFT"/>rect<br ALIGN="LEFT"/>text : str<br ALIGN="LEFT"/>text_colour : tuple<br ALIGN="LEFT"/>|paint(surface: pg.surface.Surface)<br ALIGN="LEFT"/>update(up: bool)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.cave.Cave" [color="black", fontcolor="black", label=<{Cave|coords : tuple[float, ...]<br ALIGN="LEFT"/>location : int<br ALIGN="LEFT"/>tunnels : list[int]<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"graphical.gui.element.Element" [color="black", fontcolor="black", label=<{Element|rect<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.events.EntityMoved" [color="black", fontcolor="black", label=<{EntityMoved|location : int<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.hazards.Hazard" [color="black", fontcolor="black", label=<{Hazard|level : dict[int, Cave]<br ALIGN="LEFT"/>location : int \| None<br ALIGN="LEFT"/>|nearby_msg(): str<br ALIGN="LEFT"/>on_arrow_enter(): Iterator[Event]<br ALIGN="LEFT"/>on_arrow_miss(): Iterator[Event]<br ALIGN="LEFT"/>on_player_enter(): Iterator[Event]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scenes.how_to_play.HowToPlay" [color="black", fontcolor="black", label=<{HowToPlay|back<br ALIGN="LEFT"/>background<br ALIGN="LEFT"/>screen<br ALIGN="LEFT"/>|handle_pg_events()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.level.Level" [color="black", fontcolor="black", label=<{Level|debug : bool<br ALIGN="LEFT"/>hazards : dict[int, Hazard]<br ALIGN="LEFT"/>level : dict[int, Cave]<br ALIGN="LEFT"/>player : int \| None<br ALIGN="LEFT"/>|choose_empty_cave(): Cave<br ALIGN="LEFT"/>get_cave(location: int): Cave<br ALIGN="LEFT"/>get_hazard_in_cave(cave: Cave): Hazard \| None<br ALIGN="LEFT"/>get_nearby_hazards(cave: Cave)<br ALIGN="LEFT"/>get_wumpus_location(): int<br ALIGN="LEFT"/>handle_event(event: Event): Iterator[PlayerKilled \| PlayerWon \| PlayerMoved \| ArrowHit \| str]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scenes.level_select.LevelSelect" [color="black", fontcolor="black", label=<{LevelSelect|back<br ALIGN="LEFT"/>background<br ALIGN="LEFT"/>buttons<br ALIGN="LEFT"/>screen<br ALIGN="LEFT"/>stack<br ALIGN="LEFT"/>|handle_pg_events()<br ALIGN="LEFT"/>paint()<br ALIGN="LEFT"/>update(): Iterator[SceneEvent]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scenes.menu.MainMenu" [color="black", fontcolor="black", label=<{MainMenu|background<br ALIGN="LEFT"/>buttons : list<br ALIGN="LEFT"/>screen<br ALIGN="LEFT"/>stack<br ALIGN="LEFT"/>|handle_pg_events()<br ALIGN="LEFT"/>paint()<br ALIGN="LEFT"/>update(): Iterator[SceneEvent]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scenes.paused.Paused" [color="black", fontcolor="black", label=<{Paused|background<br ALIGN="LEFT"/>buttons : list<br ALIGN="LEFT"/>screen<br ALIGN="LEFT"/>stack<br ALIGN="LEFT"/>|handle_pg_events(): Iterator[SceneEvent]<br ALIGN="LEFT"/>paint()<br ALIGN="LEFT"/>update(): Iterator[SceneEvent]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.player.PlayerController" [color="black", fontcolor="black", label=<{PlayerController|alive : bool<br ALIGN="LEFT"/>cave<br ALIGN="LEFT"/>initial_cave<br ALIGN="LEFT"/>level<br ALIGN="LEFT"/>win : bool<br ALIGN="LEFT"/>|emit_to_level(event: Event): Iterator[ArrowHit]<br ALIGN="LEFT"/>get_nearby_msgs()<br ALIGN="LEFT"/><I>handle_msg</I>(msg: str)<br ALIGN="LEFT"/>move(location: int)<br ALIGN="LEFT"/>respawn()<br ALIGN="LEFT"/>shoot(locations: list[int])<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.events.PlayerKilled" [color="black", fontcolor="black", label=<{PlayerKilled|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.events.PlayerMoved" [color="black", fontcolor="black", label=<{PlayerMoved|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.events.PlayerWon" [color="black", fontcolor="black", label=<{PlayerWon|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"graphical.scenes.playing.scene.Playing" [color="black", fontcolor="black", label=<{Playing|background<br ALIGN="LEFT"/>level<br ALIGN="LEFT"/>level_index : int<br ALIGN="LEFT"/>map<br ALIGN="LEFT"/>player<br ALIGN="LEFT"/>renderer<br ALIGN="LEFT"/>screen<br ALIGN="LEFT"/>text<br ALIGN="LEFT"/>|handle_pg_events()<br ALIGN="LEFT"/>paint()<br ALIGN="LEFT"/>update(): Iterator[SceneEvent]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scene.PopScene" [color="black", fontcolor="black", label=<{PopScene|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"graphical.scene.PushScene" [color="black", fontcolor="black", label=<{PushScene|scene<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"graphical.scenes.playing.renderer.Renderer" [color="black", fontcolor="black", label=<{Renderer|algebra<br ALIGN="LEFT"/>basis_vectors : list<br ALIGN="LEFT"/>bat_icon : NoneType<br ALIGN="LEFT"/>camera_pos : ndarray<br ALIGN="LEFT"/>dimension<br ALIGN="LEFT"/>fov : float<br ALIGN="LEFT"/>level<br ALIGN="LEFT"/>pit_icon : NoneType<br ALIGN="LEFT"/>player_icon : NoneType<br ALIGN="LEFT"/>rotor<br ALIGN="LEFT"/>wumpus_icon : NoneType<br ALIGN="LEFT"/>|apply_depth_fade(color, coords: npt.NDArray): pg.Color<br ALIGN="LEFT"/>draw_cave(surf: pg.surface.Surface, cave, coords: npt.NDArray, player: bool, explored: bool)<br ALIGN="LEFT"/>draw_icon(surf: pg.surface.Surface, icon: pg.surface.Surface \| None, size: int, opacity: int, center: pg.Vector2)<br ALIGN="LEFT"/>load_icons()<br ALIGN="LEFT"/>paint(surf: pg.surface.Surface, location: int \| None)<br ALIGN="LEFT"/>perp_dist(coord: npt.NDArray): float<br ALIGN="LEFT"/>project(coord: npt.NDArray, screen): pg.Vector2<br ALIGN="LEFT"/>reset_rotor()<br ALIGN="LEFT"/>reset_zoom()<br ALIGN="LEFT"/>rotate(bivector: MultiVector, angle: float)<br ALIGN="LEFT"/>rotated(coord: npt.NDArray): npt.NDArray<br ALIGN="LEFT"/>vector_from_multivector(mv: MultiVector)<br ALIGN="LEFT"/>zoom(value: float)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scene.Scene" [color="black", fontcolor="black", label=<{Scene|<br ALIGN="LEFT"/>|<I>enter</I>()<br ALIGN="LEFT"/><I>exit</I>()<br ALIGN="LEFT"/>handle_pg_events(): Iterator[SceneEvent]<br ALIGN="LEFT"/><I>pause</I>()<br ALIGN="LEFT"/><I>resume</I>()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scene.SceneManager" [color="black", fontcolor="black", label=<{SceneManager|scenes : list[Scene]<br ALIGN="LEFT"/>|current()<br ALIGN="LEFT"/>handle_pg_events()<br ALIGN="LEFT"/>pop()<br ALIGN="LEFT"/>push(scene: Scene)<br ALIGN="LEFT"/>switch(new_scene: Scene)<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.hazards.Superbats" [color="black", fontcolor="black", label=<{Superbats|location<br ALIGN="LEFT"/>|nearby_msg()<br ALIGN="LEFT"/>on_player_enter()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.scene.SwitchScene" [color="black", fontcolor="black", label=<{SwitchScene|scene<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"wumpus.tests.test_player.TestPlayerController" [color="black", fontcolor="black", label=<{TestPlayerController|level<br ALIGN="LEFT"/>player<br ALIGN="LEFT"/>|setUp()<br ALIGN="LEFT"/>test_bats()<br ALIGN="LEFT"/>test_eaten()<br ALIGN="LEFT"/>test_pit()<br ALIGN="LEFT"/>test_shoot_self()<br ALIGN="LEFT"/>test_shoot_wumpus()<br ALIGN="LEFT"/>test_spawn()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.tests.test_hazards.TestWumpus" [color="black", fontcolor="black", label=<{TestWumpus|<br ALIGN="LEFT"/>|test_enter()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"graphical.gui.vstack.VStack" [color="black", fontcolor="black", label=<{VStack|elements : Sequence[Element]<br ALIGN="LEFT"/>gap : int<br ALIGN="LEFT"/>rect<br ALIGN="LEFT"/>width : int<br ALIGN="LEFT"/>|update()<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.hazards.Wumpus" [color="black", fontcolor="black", label=<{Wumpus|location : int<br ALIGN="LEFT"/>|nearby_msg()<br ALIGN="LEFT"/>on_arrow_enter()<br ALIGN="LEFT"/>on_arrow_miss()<br ALIGN="LEFT"/>on_player_enter()<br ALIGN="LEFT"/>startle(): Iterator[Event]<br ALIGN="LEFT"/>}>, shape="record", style="solid"];
"wumpus.events.WumpusMoved" [color="black", fontcolor="black", label=<{WumpusMoved|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"graphical.gui.button.Button" -> "graphical.gui.element.Element" [arrowhead="empty", arrowtail="none"];
"graphical.scenes.how_to_play.HowToPlay" -> "graphical.scene.Scene" [arrowhead="empty", arrowtail="none"];
"graphical.scenes.level_select.LevelSelect" -> "graphical.scene.Scene" [arrowhead="empty", arrowtail="none"];
"graphical.scenes.menu.MainMenu" -> "graphical.scene.Scene" [arrowhead="empty", arrowtail="none"];
"graphical.scenes.paused.Paused" -> "graphical.scene.Scene" [arrowhead="empty", arrowtail="none"];
"graphical.scenes.playing.scene.Playing" -> "graphical.scene.Scene" [arrowhead="empty", arrowtail="none"];
"wumpus.events.ArrowShot" -> "wumpus.events.EntityMoved" [arrowhead="empty", arrowtail="none"];
"wumpus.events.PlayerMoved" -> "wumpus.events.EntityMoved" [arrowhead="empty", arrowtail="none"];
"wumpus.events.WumpusMoved" -> "wumpus.events.EntityMoved" [arrowhead="empty", arrowtail="none"];
"wumpus.hazards.BottomlessPit" -> "wumpus.hazards.Hazard" [arrowhead="empty", arrowtail="none"];
"wumpus.hazards.Superbats" -> "wumpus.hazards.Hazard" [arrowhead="empty", arrowtail="none"];
"wumpus.hazards.Wumpus" -> "wumpus.hazards.Hazard" [arrowhead="empty", arrowtail="none"];
"graphical.gui.button.Button" -> "graphical.scenes.how_to_play.HowToPlay" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="back", style="solid"];
"graphical.gui.button.Button" -> "graphical.scenes.level_select.LevelSelect" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="back", style="solid"];
"graphical.gui.vstack.VStack" -> "graphical.scenes.level_select.LevelSelect" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="stack", style="solid"];
"graphical.gui.vstack.VStack" -> "graphical.scenes.menu.MainMenu" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="stack", style="solid"];
"graphical.gui.vstack.VStack" -> "graphical.scenes.paused.Paused" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="stack", style="solid"];
"graphical.scene.Scene" -> "graphical.scene.PushScene" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="scene", style="solid"];
"graphical.scene.Scene" -> "graphical.scene.SwitchScene" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="scene", style="solid"];
"graphical.scenes.playing.renderer.Renderer" -> "graphical.scenes.playing.scene.Playing" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="renderer", style="solid"];
"wumpus.level.Level" -> "graphical.scenes.playing.scene.Playing" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="level", style="solid"];
"wumpus.level.Level" -> "wumpus.tests.test_player.TestPlayerController" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="level", style="solid"];
"wumpus.player.PlayerController" -> "graphical.scenes.playing.scene.Playing" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="player", style="solid"];
"wumpus.player.PlayerController" -> "wumpus.tests.test_player.TestPlayerController" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="player", style="solid"];
"wumpus.level.Level" -> "graphical.scenes.playing.renderer.Renderer" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="level", style="solid"];
"wumpus.level.Level" -> "wumpus.player.PlayerController" [arrowhead="odiamond", arrowtail="none", fontcolor="green", label="level", style="solid"];
}
